Repository: BravoBaldo/Translations
Catalog: GoogleTest/GoogleTest_OmegaT/omegat/project_save.tmx
Source language: en_us
Languages: it_it

source: This section covers some less frequently used, but still significant, assertions.
it_it: Questa sezione copre alcune asserzioni usate meno frequentemente, ma comunque significative.

source: This section describes several of them.
it_it: Questa sezione ne descrive alcune.

source: This section discusses some of the cool things that you can do with the arguments to the testing framework.
it_it: Questa sezione illustra alcune delle cose interessanti che si possono fare con gli argomenti del framework di testing.

source: This seems pretty tedious.
it_it: Sembra piuttosto noioso.

source: This sounds simple, except for one problem: a destructor is a special function with special syntax and special semantics, and the MOCK_METHOD macro doesn't work for it:
it_it: Sembra semplice, tranne che per un problema: un distruttore è una funzione speciale con una sintassi e una semantica speciali e la macro MOCK_METHOD non funziona per questo:

source: This sounds simple, except for one problem: a destructor is a special function with special syntax and special semantics, and the `MOCK_METHOD` macro doesn't work for it:
it_it: Sembra semplice, tranne che per un problema: un distruttore è una funzione speciale con una sintassi e una semantica speciali e la macro `MOCK_METHOD` non funziona per questo:

source: This sucks big time!!!
it_it: Questo fa davvero schifo!!!

source: This syntax allows the test writer to specify "called with any arguments" without explicitly specifying the number or types of arguments.
it_it: Questa sintassi consente a chi scrive il test di specificare che è "chiamato con qualsiasi argomento" senza specificare esplicitamente il numero o il tipo di argomenti.

source: This syntax is designed to make an expectation read like English.
it_it: Questa sintassi è progettata per far sì che una expectation venga letta come l'inglese.

source: This technique incurs some overhead:
it_it: Questa tecnica comporta un po' di lavoro:

source: This technique is very similar to the delegating-to-fake technique, the difference being that we use a real object instead of a fake.
it_it: Questa tecnica è molto simile alla delegating-to-fake, con la differenza che utilizziamo un oggetto reale invece di un fake.

source: This technique is very similar to the [delegating-to-fake](#DelegatingToFake) technique, the difference being that we use a real object instead of a fake.
it_it: Questa tecnica è molto simile alla [delegating-to-fake](#DelegatingToFake), con la differenza che utilizziamo un oggetto reale invece di un fake.

source: This technique may also be applied to make overloaded methods more amenable to mocking.
it_it: Questa tecnica può essere applicata anche per facilitare la creazione di mock dei metodi [overloaded].

source: This tells gMock that you do expect the calls and no warning should be printed.
it_it: Questo dice a gMock che ci si aspettano le chiamate e non dovrebbe essere stampato alcun warning.

source: This tutorial aims to get you up and running with GoogleTest using CMake.
it_it: Questo tutorial ha lo scopo rendere operativi con l'uso di GoogleTest con CMake.

source: This tutorial aims to get you up and running with GoogleTest using the Bazel build system.
it_it: Questo tutorial ha lo scopo rendere operativi con l'uso di GoogleTest col sistema di build Bazel.

source: This user's guide has the following contents:
it_it: Questa guida l'utente ha i seguenti contenuti:

source: This way, even if you #include your mock class in N files, the compiler only needs to generate its constructor and destructor once, resulting in a much faster compilation.
it_it: In questo modo, anche se si #include la classe mock in N file, il compilatore dovrà generare il suo costruttore e distruttore solo una volta, ne risulterà una compilazione molto più veloce.

source: This way, even if you `#include` your mock class in N files, the compiler only needs to generate its constructor and destructor once, resulting in a much faster compilation.
it_it: In questo modo, anche se si `#include` la classe mock in N file, il compilatore dovrà generare il suo costruttore e distruttore solo una volta, ne risulterà una compilazione molto più veloce.

source: This way, you can easily separate the two using redirection.
it_it: In questo modo, si possono facilmente separare i due utilizzando il reindirizzamento.

source: This way, you can fully test your internal implementation without leaking it to your clients.
it_it: In questo modo, si può testare completamente l'implementazione interna senza divulgarla ai clienti.

source: This way, you don't need to worry about bar being modified or destroyed after the EXPECT_CALL() is executed.
it_it: In questo modo, non ci si deve preoccupare che la bar venga modificata o distrutta dopo l'esecuzione di EXPECT_CALL().

source: This way, you don't need to worry about `bar` being modified or destroyed after the `EXPECT_CALL()` is executed.
it_it: In questo modo, non ci si deve preoccupare che la `bar` venga modificata o distrutta dopo l'esecuzione di `EXPECT_CALL()`.

source: This weakens your control on the class because now it's harder to maintain the class invariants.
it_it: Ciò indebolisce il controllo sulla classe perché ora è più difficile mantenere le invarianti della classe.

source: This will exclude it from execution.
it_it: Ciò lo escluderà dall'esecuzione.

source: This works for all non-overloaded methods; if a method is overloaded, you need to help gMock resolve which overload is expected by specifying the number of arguments and possibly also the types of the arguments.
it_it: Funziona con tutti i metodi non-overloaded; se un metodo lo è, è necessario aiutare gMock a risolvere quale overload ci si aspetta specificando il numero di argomenti ed eventualmente anche i tipi degli argomenti.

source: This works for all non-overloaded methods; if a method is overloaded, you need to help gMock resolve which overload is expected by specifying the number of arguments and possibly also the [types of the arguments](gmock_cook_book.md#SelectOverload).
it_it: Funziona con tutti i metodi non-overloaded; se un metodo lo è, è necessario aiutare gMock a risolvere quale overload ci si aspetta specificando il numero di argomenti ed eventualmente anche i [tipi degli argomenti](gmock_cook_book.md#SelectOverload).

source: Though you may be tempted, DO NOT use std::ref():
it_it: Anche se si potrebbe essere tentati, NON USARE std::ref():

source: Though you may be tempted, DO NOT use `std::ref()`:
it_it: Anche se si potrebbe essere tentati, NON USARE `std::ref()`:

source: Throws the given exception, which can be any copyable value.
it_it: Genera l'eccezione specificata, che può essere qualsiasi valore copiabile.

source: Thus, tests are kept independent of each other.
it_it: Pertanto, i test vengono mantenuti indipendenti l'uno dall'altro.

source: Thus, the assertions can be used safely in destructors, too.
it_it: Pertanto, le asserzioni sono utilizzabili in modo sicuro anche nei distruttori.

source: Thus, you can detect and fix multiple bugs in a single run-edit-compile cycle.
it_it: Pertanto, si possono rilevare e correggere più bug in un singolo ciclo di esecuzione-modifica-compilazione.

source: Time for another quiz!
it_it: È ora di un altro quiz!

source: To do that, define an AbslStringify() overload as a friend function template for your type:
it_it: Per farlo, si definisce un overload di AbslStringify() come una funzione template friend per il proprio tipo:

source: To fix that, use using to bring them in scope:
it_it: Per risolvere questo problema, usare using per inserirli nello scope:

source: To generate the JSON report, set the GTEST_OUTPUT environment variable or the --gtest_output flag to the string "json:path_to_output_file", which will create the file at the given location.
it_it: Per generare il report JSON, si imposta la variabile di ambiente GTEST_OUTPUT o il flag --gtest_output con la stringa "json:path_to_output_file", che creerà il file nella posizione specificata.

source: To say this in gMock is easy:
it_it: Dirlo in gMock è semplice:

source: To access a class' private members, you can declare your test fixture as a friend to the class and define accessors in your fixture.
it_it: Per accedere ai membri privati di una classe, si può dichiarare la fixture come friend della classe e definire gli accessor nella fixture.

source: To accommodate for the differences, you can write factory function wrappers and pass these function pointers to the tests as their parameters.
it_it: Per compensare le differenze, è possibile scrivere wrapper di funzioni factory e passare questi puntatori a funzione ai test come parametri.

source: To achieve that, set the GTEST_CATCH_EXCEPTIONS environment variable to 0, or use the --gtest_catch_exceptions=0 flag when running the tests.
it_it: Per raggiungere questo obiettivo, si imposta la variabile di ambiente GTEST_CATCH_EXCEPTIONS su 0 o si usa il flag --gtest_catch_exceptions=0 durante l'esecuzione dei test.

source: To achieve that, set the `GTEST_CATCH_EXCEPTIONS` environment variable to `0`, or use the `--gtest_catch_exceptions=0` flag when running the tests.
it_it: Per raggiungere questo obiettivo, si imposta la variabile di ambiente `GTEST_CATCH_EXCEPTIONS` su `0` o si usa il flag `--gtest_catch_exceptions=0` durante l'esecuzione dei test.

source: To alleviate this problem, you can use WaitForNotificationWithTimeout(ms) instead of WaitForNotification().
it_it: Per alleviare questo problema, si può utilizzare WaitForNotificationWithTimeout(ms) invece di WaitForNotification().

source: To alleviate this problem, you can use `WaitForNotificationWithTimeout(ms)` instead of `WaitForNotification()`.
it_it: Per alleviare questo problema, si può utilizzare `WaitForNotificationWithTimeout(ms)` invece di `WaitForNotification()`.

source: To alleviate this, GoogleTest provides three different solutions.
it_it: Per alleviare questo problema, GoogleTest fornisce tre diverse soluzioni.

source: To avoid repeating global set-up/tear-down, specify --gtest_recreate_environments_when_repeating=false{.nowrap}.
it_it: Per evitare di ripetere il set-up/tear-down globale, si specifica --gtest_recreate_environments_when_repeating=false{.nowrap}.

source: To avoid unintended ambiguity, this syntax may only be used for methods that are not overloaded.
it_it: Per evitare ambiguità indesiderate, questa sintassi può essere utilizzata solo per metodi che non sono sovraccaricati [overloaded].

source: To avoid repeating global set-up/tear-down, specify `--gtest_recreate_environments_when_repeating=false`{.nowrap}.
it_it: Per evitare di ripetere il set-up/tear-down globale, si specifica `--gtest_recreate_environments_when_repeating=false`{.nowrap}.

source: To avoid such problems, many programmers have been practicing "coding to interfaces": instead of talking to the Concrete class, your code would define an interface and talk to it.
it_it: Per evitare tali problemi, molti programmatori praticano la "codificazione delle interfacce": invece di parlare con la classe Concrete, il codice dovrebbe definire un'interfaccia e comunicare tramite essa.

source: To avoid such problems, many programmers have been practicing "coding to interfaces": instead of talking to the `Concrete` class, your code would define an interface and talk to it.
it_it: Per evitare tali problemi, molti programmatori praticano la "codificazione delle interfacce": invece di parlare con la classe `Concrete`, il codice dovrebbe definire un'interfaccia e comunicare tramite essa.

source: To build the code, add the following to the end of your CMakeLists.txt file:
it_it: Per creare il codice, si aggiunge quanto segue alla fine del file CMakeLists.txt:

source: To build the code, add the following to the end of your `CMakeLists.txt` file:
it_it: Per creare il codice, si aggiunge quanto segue alla fine del file `CMakeLists.txt`:

source: To build the code, create a file named BUILD in the same directory with the following contents:
it_it: Per buildare il codice, si crea un file denominato BUILD nella stessa directory con il seguente contenuto:

source: To build the code, create a file named `BUILD` in the same directory with the following contents:
it_it: Per buildare il codice, si crea un file denominato `BUILD` nella stessa directory con il seguente contenuto:

source: To compare a C string with NULL, use EXPECT_EQ(c_string, nullptr) or EXPECT_NE(c_string, nullptr).
it_it: Per confrontare una stringa C con NULL, si usa EXPECT_EQ(c_string, nullptr) o EXPECT_NE(c_string, nullptr).

source: To compare a C string with `NULL`, use `EXPECT_EQ(`*`c_string`*`, nullptr)` or `EXPECT_NE(`*`c_string`*`, nullptr)`.
it_it: Per confrontare una stringa C con `NULL`, si usa `EXPECT_EQ(`*`c_string`*`, nullptr)` o `EXPECT_NE(`*`c_string`*`, nullptr)`.

source: To compare two string objects, use EXPECT_EQ or EXPECT_NE instead.
it_it: Per confrontare due oggetti string, si usa invece EXPECT_EQ o EXPECT_NE.

source: To compare two `string` objects, use [`EXPECT_EQ`](#EXPECT_EQ) or [`EXPECT_NE`](#EXPECT_NE) instead.
it_it: Per confrontare due oggetti `string`, si usa invece [`EXPECT_EQ`](#EXPECT_EQ) o [`EXPECT_NE`](#EXPECT_NE).

source: To complete this tutorial, you'll need:
it_it: Per questo tutorial, c'è bisogno di:

source: To create a "nice" mock, which ignores all uninteresting calls, a "naggy" mock, which warns on all uninteresting calls, or a "strict" mock, which treats them as failures:
it_it: Per creare un "nice" mock, che ignora tutte le chiamate [uninteresting], un mock "naggy", che emette warning su tutte le chiamate [uninteresting], o un mock "strict", che li tratta come fallimenti:

source: To create a fixture:
it_it: Per creare una fixture:

source: To create a test:
it_it: Per creare un test:

source: To create an instance of an action template, write:
it_it: Per creare un'istanza di una action template, si scrive:

source: To create an instance of this class, use one of the factory functions AssertionSuccess() or AssertionFailure().
it_it: Per creare un'istanza di questa classe, utilizzare una delle funzioni factory AssertionSuccess() o AssertionFailure().

source: To create an instance of this class, use one of the factory functions [`AssertionSuccess()`](#AssertionSuccess) or [`AssertionFailure()`](#AssertionFailure).
it_it: Per creare un'istanza di questa classe, utilizzare una delle funzioni factory [`AssertionSuccess()`](#AssertionSuccess) o [`AssertionFailure()`](#AssertionFailure).

source: To customize the default action for a particular method of a specific mock object, use ON_CALL.
it_it: Per personalizzare l'azione di default per un metodo particolare di uno specifico oggetto mock, si usa ON_CALL.

source: To customize the default action for a particular method of a specific mock object, use [`ON_CALL`](reference/mocking.md#ON_CALL).
it_it: Per personalizzare l'azione di default per un metodo particolare di uno specifico oggetto mock, si usa [`ON_CALL`](reference/mocking.md#ON_CALL).

source: To customize the default action for functions with return type T, use DefaultValue<T>.
it_it: Per personalizzare l'azione di default per le funzioni con tipo restituito T, si usa DefaultValue<T>.

source: To customize the default action for functions with return type `T`, use [`DefaultValue<T>`](reference/mocking.md#DefaultValue).
it_it: Per personalizzare l'azione di default per le funzioni con tipo restituito `T`, si usa [`DefaultValue<T>`](reference/mocking.md#DefaultValue).

source: To define a event listener, you subclass either testing::TestEventListener or testing::EmptyTestEventListener The former is an (abstract) interface, where each pure virtual method can be overridden to handle a test event (For example, when a test starts, the OnTestStart() method will be called.).
it_it: Per definire un event listener, si crea una sottoclasse di testing::TestEventListener o di testing::EmptyTestEventListener. La prima è un'interfaccia (astratta), in cui ciascun metodo virtuale puro può essere sovrascritto [overridden] per gestire un evento di test (Per esempio, quando inizia un test, verrà chiamato il metodo OnTestStart()).

source: To define a event listener, you subclass either [`testing::TestEventListener`](reference/testing.md#TestEventListener) or [`testing::EmptyTestEventListener`](reference/testing.md#EmptyTestEventListener) The former is an (abstract) interface, where *each pure virtual method can be overridden to handle a test event* (For example, when a test starts, the `OnTestStart()` method will be called.).
it_it: Per definire un event listener, si crea una sottoclasse di [`testing::TestEventListener`](reference/testing.md#TestEventListener) o di [`testing::EmptyTestEventListener`](reference/testing.md#EmptyTestEventListener). La prima è un'interfaccia (astratta), in cui *ciascun metodo virtuale puro può essere sovrascritto [overridden] per gestire un evento di test* (Per esempio, quando inizia un test, verrà chiamato il metodo `OnTestStart()`).

source: To define abstract tests, you should organize your code like this:
it_it: Per definire test astratti, si deve organizzare il codice in questo modo:

source: To disable that, run the test program with the --gtest_print_time=0 command line flag, or set the GTEST_PRINT_TIME environment variable to 0.
it_it: Per disabilitarlo, si esegue il programma di test con il flag della riga di comando --gtest_print_time=0 o si setta la variabile di ambiente GTEST_PRINT_TIME a 0.

source: To disable that, run the test program with the `--gtest_print_time=0` command line flag, or set the GTEST_PRINT_TIME environment variable to `0`.
it_it: Per disabilitarlo, si esegue il programma di test con il flag della riga di comando `--gtest_print_time=0` o si setta la variabile di ambiente GTEST_PRINT_TIME a `0`.

source: To disambiguate a mock function (the one you specify inside the parentheses of ON_CALL()), use this technique; to disambiguate a fake function (the one you place inside Invoke()), use a static_cast to specify the function's type.
it_it: Per chiarire le ambiguità di una funzione mock (quella specificata tra parentesi di ON_CALL()), utilizzare questa tecnica; per disambiguare una funzione fake (quella che si inserisce all'interno di Invoke()), usare un static_cast per specificare il tipo della funzione.

source: To disambiguate a mock function (the one you specify inside the parentheses of `ON_CALL()`), use [this technique](#SelectOverload); to disambiguate a fake function (the one you place inside `Invoke()`), use a `static_cast` to specify the function's type.
it_it: Per chiarire le ambiguità di una funzione mock (quella specificata tra parentesi di `ON_CALL()`), utilizzare [questa tecnica](#SelectOverload); per disambiguare una funzione fake (quella che si inserisce all'interno di `Invoke()`), usare uno `static_cast` per specificare il tipo della funzione.

source: To disambiguate functions overloaded on the const-ness of this object, use the Const() argument wrapper.
it_it: Per chiarire le ambiguità delle funzioni overloaded tramite l'essere const di questo oggetto, si usa l'argomento wrapper di Const().

source: To disambiguate functions overloaded on the const-ness of this object, use the `Const()` argument wrapper.
it_it: Per chiarire le ambiguità delle funzioni overloaded tramite l'essere const di questo oggetto, si usa l'argomento wrapper di `Const()`.

source: To disambiguate overloaded functions with the same number of arguments but different argument types, you may need to specify the exact type of a matcher, either by wrapping your matcher in Matcher<type>(), or using a matcher whose type is fixed (TypedEq<type>, An<type>(), etc):
it_it: Per chiarire le ambiguità delle funzioni overloaded con lo stesso numero di argomenti ma tipi di argomento diversi, potrebbe essere necessario specificare il tipo esatto di un matcher, racchiudendolo in Matcher<type>() o utilizzando un matcher il cui tipo è fisso (TypedEq<type>, An<type>(), ecc.):

source: To disambiguate overloaded functions with the same number of arguments but different argument types, you may need to specify the exact type of a matcher, either by wrapping your matcher in `Matcher<type>()`, or using a matcher whose type is fixed (`TypedEq<type>`, `An<type>()`, etc):
it_it: Per chiarire le ambiguità delle funzioni overloaded con lo stesso numero di argomenti ma tipi di argomento diversi, potrebbe essere necessario specificare il tipo esatto di un matcher, racchiudendolo in `Matcher<type>()` o utilizzando un matcher il cui tipo è fisso (`TypedEq<type>`, `An<type>()`, ecc.):

source: To distinguish different instances of the pattern, the first argument to the INSTANTIATE_TYPED_TEST_SUITE_P macro is a prefix that will be added to the actual test suite name.
it_it: Per distinguere le diverse istanze del pattern, il primo argomento della macro INSTANTIATE_TYPED_TEST_SUITE_P è un prefisso che verrà anteposto al nome effettivo della test suite.

source: To distinguish different instances of the pattern, the first argument to the `INSTANTIATE_TYPED_TEST_SUITE_P` macro is a prefix that will be added to the actual test suite name.
it_it: Per distinguere le diverse istanze del pattern, il primo argomento della macro `INSTANTIATE_TYPED_TEST_SUITE_P` è un prefisso che verrà anteposto al nome effettivo della test suite.

source: To do that, define an `AbslStringify()` overload as a `friend` function template for your type:
it_it: Per farlo, si definisce un overload di `AbslStringify()` come una funzione template `friend` per il proprio tipo:

source: To do this, in the root directory of your workspace (my_workspace/), create a file named WORKSPACE with the following contents:
it_it: Per farlo, nella directory principale del workspace (my_workspace/), si crea un file chiamato WORKSPACE col seguente contenuto:

source: To do this, in the root directory of your workspace (`my_workspace/`), create a file named `WORKSPACE` with the following contents:
it_it: Per farlo, nella directory principale del workspace (`my_workspace/`), si crea un file chiamato `WORKSPACE` col seguente contenuto:

source: To do this, in your project directory (my_project), create a file named CMakeLists.txt with the following contents:
it_it: Per farlo, nella directory del progetto (my_project), si crea un file chiamato CMakeLists.txt con i seguenti contenuti:

source: To do this, in your project directory (`my_project`), create a file named `CMakeLists.txt` with the following contents:
it_it: Per farlo, nella directory del progetto (`my_project`), si crea un file chiamato `CMakeLists.txt` con i seguenti contenuti:

source: To do this, let's assume the final prefix of the cross-compiled installation will be /usr, and your sysroot is /home/MYUSER/sysroot.
it_it: Per farlo, supponiamo che il prefisso finale dell'installazione cross-compilata sia /usr e che il sysroot sia /home/MYUSER/sysroot.

source: To do this, let's assume the final prefix of the cross-compiled installation will be `/usr`, and your sysroot is `/home/MYUSER/sysroot`.
it_it: Per farlo, supponiamo che il prefisso finale dell'installazione cross-compilata sia `/usr` e che il sysroot sia `/home/MYUSER/sysroot`.

source: To enable it, set the GTEST_BREAK_ON_FAILURE environment variable to a value other than 0.
it_it: Per abilitarlo, si imposta la variabile di ambiente GTEST_BREAK_ON_FAILURE su un valore diverso da 0.

source: To enable it, set the `GTEST_BREAK_ON_FAILURE` environment variable to a value other than `0`.
it_it: Per abilitarlo, si imposta la variabile di ambiente `GTEST_BREAK_ON_FAILURE` su un valore diverso da `0`.
